---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.InvalidLoadClassificationValue
source: html/ca75e4f4-da4c-ad1c-000b-e74bc8ab1c7f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.InvalidLoadClassificationValue Property

The load classification parameter cannot be empty. Please select a valid load classification element for the connector parameter and the associated family parameter.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidLoadClassificationValue { get; }
```